export const data = [
  {
    title: "Откуда вы знаете продажи каждого товара на wildberries?",
    content:
      "Удобная оплата на сайте. Или счет для юр.лица или ИП. Закрывающие документы автоматически появляются в личном кабинете",
  },
  {
    title: "Какие данные и отчеты доступны в платформе wecheck?",
    content:
      "Удобная оплата на сайте. Или счет для юр.лица или ИП. Закрывающие документы автоматически появляются в личном кабинете",
  },
  {
    title:
      "Смотрите отчеты, экспортируйте в свою систему аналитики или получайте данные по API",
    content:
      "Удобная оплата на сайте. Или счет для юр.лица или ИП. Закрывающие документы автоматически появляются в личном кабинете",
  },
  {
    title: "На какой период можно оплатить подписку?",
    content:
      "Удобная оплата на сайте. Или счет для юр.лица или ИП. Закрывающие документы автоматически появляются в личном кабинете",
  },
  {
    title: "По каким регионам вы собираете информацию?",
    content:
      "Удобная оплата на сайте. Или счет для юр.лица или ИП. Закрывающие документы автоматически появляются в личном кабинете",
  },
  {
    title: "По каким регионам вы собираете информацию?",
    content:
      "Удобная оплата на сайте. Или счет для юр.лица или ИП. Закрывающие документы автоматически появляются в личном кабинете",
  },
  {
    title:
      "Можно ли одновременно пользоваться платформой wecheck с нескольких компьютеров?",
    content:
      "Удобная оплата на сайте. Или счет для юр.лица или ИП. Закрывающие документы автоматически появляются в личном кабинете",
  },
  {
    title:
      "Мне не хватает данных, сможете добавить нужную мне информацию в отчет?",
    content:
      "Удобная оплата на сайте. Или счет для юр.лица или ИП. Закрывающие документы автоматически появляются в личном кабинете",
  },
  {
    title: "Какая погрешность в ваших данных?",
    content:
      "Удобная оплата на сайте. Или счет для юр.лица или ИП. Закрывающие документы автоматически появляются в личном кабинете",
  },
  {
    title: "Каким образом я могу применять ваши данные?",
    content:
      "Удобная оплата на сайте. Или счет для юр.лица или ИП. Закрывающие документы автоматически появляются в личном кабинете",
  },
  {
    title: "За какой период у вас есть данные?",
    content:
      "Удобная оплата на сайте. Или счет для юр.лица или ИП. Закрывающие документы автоматически появляются в личном кабинете",
  },
  {
    title: "Хочу посмотреть, могу демо-доступ?",
    content:
      "Удобная оплата на сайте. Или счет для юр.лица или ИП. Закрывающие документы автоматически появляются в личном кабинете",
  },
  {
    title:
      "Можно ли размещать информацию полученную на платформе wecheck на сторонних ресурсах?",
    content:
      "Удобная оплата на сайте. Или счет для юр.лица или ИП. Закрывающие документы автоматически появляются в личном кабинете",
  },
  {
    title: "Можно ли добавить в отчет нужный мне интернет-магазин?",
    content:
      "Удобная оплата на сайте. Или счет для юр.лица или ИП. Закрывающие документы автоматически появляются в личном кабинете",
  },
];
